Revit 2024 API
DesignToFabricationConverter.GetDesignElementAndFabricationPartsWithDifferentOffsets Method
 Gets the collection of design elements that failed to convert and the associated set of fabrication parts with different offsets.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IDictionary<ElementId, ISet<ElementId>> GetDesignElementAndFabricationPartsWithDifferentOffsets()
Visual Basic
Public Function GetDesignElementAndFabricationPartsWithDifferentOffsets As IDictionary(Of ElementId, ISet(Of ElementId))
Visual C++
public:
IDictionary<ElementId^, ISet<ElementId^>^>^ GetDesignElementAndFabricationPartsWithDifferentOffsets()
Return Value
 A map of design element identifiers that were not converted and the associated set fabrication parts left with different offsets.
Remarks
 This set of element identifiers is only available after the Convert method has been invoked, and returns DesignToFabricationConverterResult::Enum::PartialFailure.
See Also
DesignToFabricationConverter Class
Autodesk.Revit.DB.Fabrication Namespace